mesh_study/case_2000L/case_2000L_mesh2/0.org/km
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      km;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.0029232467417088e-05;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phim;
        inletValue      uniform 6.7335e-11;
        value           uniform 6.7335e-11;
    }
    wall
    {
        type            zeroGradient;
        value           $internalField;
    }
    sparger_upper
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
