mesh_study/case_2000L/case_2000L_mesh2/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "/data/openfoam-10/run/of-bioreactors/configs/fvConstraints.default"
#include "/data/openfoam-10/run/of-bioreactors/configs/fvConstraints.T"

// ************************************************************************* //
