mesh_study/case_2000L/case_2000L_mesh2/system/include/probe_locations
// x y z //
( 0.2890652521490606 0.2494848 0.28906525214906054 )
( 0.2890652521490606 0.4672 0.28906525214906054 )
( 0.2890652521490606 1.2848 0.28906525214906054 )
( 0.2890652521490606 2.1024 0.28906525214906054 )
