mesh_study/case_2000L/case_2000L_mesh2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1e-3
    volScalarFieldValue alpha.water 0.999
);

regions
(
    boxToCell
    {
        box (-0.584 1.8688 -0.584) (0.584 2.336 0.584);
        fieldValues
        (
            volScalarFieldValue alpha.air 0.999999
            volScalarFieldValue alpha.water 1e-6
        );
    }
);


// ************************************************************************* //
