mesh_study/case_2000L/case_2000L_mesh2/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("tankwall.stl"  "sparger_upper.stl" "sparger_lower.stl" "impeller_and_disk.stl" "rushton_blades.stl" "pitched_blades.stl" "shaft.stl" "impeller_shaft.stl" "disk.stl" "outlet.stl" "MRF.stl" "baffles.stl");

// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges
includedAngle           150;

writeObj                yes;
verboseObj              yes;
writeVTK                yes;

// ************************************************************************* //
